# -*- mode:org; epa-file-encrypt-to: ("1102102EBE7C3AE4" "929E9F75D4928BCF") -*-
#+title: pagr
#+subtitle: Deal with multiple git repositories
#+date: <2022-04-04 Mon 16:30>
#+description:
#+keywords:
#+subauthor:
#+html_doctype: html5
#+html_container: div
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head:
#+html_head_extra:
#+infojs_opt:
#+creator: Emacs and Org Mode on Guix
#+latex_header:
#+texinfo_filename: doc/pagr.info
#+texinfo_class: info
#+texinfo_header:
#+texinfo_post_header:
#+texinfo_dir_category: yewscion
#+texinfo_dir_title: Project Name
#+texinfo_dir_desc: A one sentence description
#+texinfo_printed_title: Project Name
#+man_class:
#+man_class_options:
#+man_header:
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+options: html-preamble:nil html-scripts:nil html-style:nil
#+options: html-link-use-abs-url:nil html-postamble:nil
#+options: html5-fancy:nil tex:t
#+author: Christopher Rodriguez
#+email: yewscion@gmail.com
#+language: en
#+select_tags: export yup
#+exclude_tags: noexport nope
#+property: header-args :mkdirp yes :results output verbatim
#+property: header-args:text :eval never :noweb yes
#+property: header-args:markdown :eval never :noweb yes
#+property: header-args:fundamental :eval never :noweb yes
#+property: header-args:lisp :noweb yes :mkdirp yes
#+property: header-args:scheme :noweb yes :mkdirp yes :session GUILE
#+property: header-args:dot :cmd sfdp :mkdirp yes
#+property: header-args:bash :dir ~ :shebang #!/usr/bin/env -S bash -i
#+macro: project-name pagr
#+export_file_name: doc/pagr
*** Preamble
We require the files defined above, as well as [[https://srfi.schemers.org/srfi-64/srfi-64.html][SRFI-64]] for a testing
framework.

#+begin_src scheme
#!/usr/bin/env -S guile -e main -s
-e main -s
!#
(use-modules ((srfi srfi-64))) ;; For Unit Testing
(load "<<project-name>>.scm")
#+end_src

#+RESULTS:
: #<unspecified>

Then we move on to the actual tests.

*** Main

#+begin_src scheme
(define (main args)
  (basic-tests))
#+end_src
#+RESULTS:
: #<unspecified>

